{
  "hadiths": [
    {
      "id": 1,
      "number": 1,
      "title": "حديث جبريل في الإسلام والإيمان والإحسان",
      "text": "عن عمر بن الخطاب رضي الله عنه قال: بينما نحن عند رسول الله صلى الله عليه وسلم ذات يوم إذ طلع علينا رجل شديد بياض الثياب شديد سواد الشعر لا يرى عليه أثر السفر ولا يعرفه منا أحد، حتى جلس إلى النبي صلى الله عليه وسلم فأسند ركبتيه إلى ركبتيه ووضع كفيه على فخذيه وقال: يا محمد أخبرني عن الإسلام، فقال رسول الله صلى الله عليه وسلم: الإسلام أن تشهد أن لا إله إلا الله وأن محمداً رسول الله وتقيم الصلاة وتؤتي الزكاة وتصوم رمضان وتحج البيت إن استطعت إليه سبيلاً",
      "source": "صحيح مسلم (8)، صحيح البخاري (50)",
      "category": "العقيدة والإيمان",
      "grade": "صحيح متفق عليه"
    },
    {
      "id": 2,
      "number": 2,
      "title": "أركان الإيمان",
      "text": "عن أبي هريرة رضي الله عنه قال: قال رسول الله صلى الله عليه وسلم: الإيمان بضع وسبعون أو بضع وستون شعبة، فأفضلها قول لا إله إلا الله، وأدناها إماطة الأذى عن الطريق، والحياء شعبة من الإيمان",
      "source": "صحيح مسلم (35)، صحيح البخاري (9)",
      "category": "العقيدة والإيمان",
      "grade": "صحيح متفق عليه"
    },
    {
      "id": 3,
      "number": 3,
      "title": "حلاوة الإيمان",
      "text": "عن أنس بن مالك رضي الله عنه عن النبي صلى الله عليه وسلم قال: ثلاث من كن فيه وجد حلاوة الإيمان: أن يكون الله ورسوله أحب إليه مما سواهما، وأن يحب المرء لا يحبه إلا لله، وأن يكره أن يعود في الكفر كما يكره أن يقذف في النار",
      "source": "صحيح البخاري (16)، صحيح مسلم (43)",
      "category": "العقيدة والإيمان",
      "grade": "صحيح متفق عليه"
    },
    {
      "id": 4,
      "number": 4,
      "title": "علامات النفاق",
      "text": "عن أبي هريرة رضي الله عنه عن النبي صلى الله عليه وسلم قال: آية المنافق ثلاث: إذا حدث كذب، وإذا وعد أخلف، وإذا اؤتمن خان",
      "source": "صحيح البخاري (33)، صحيح مسلم (59)",
      "category": "العقيدة والإيمان",
      "grade": "صحيح متفق عليه"
    },
    {
      "id": 5,
      "number": 5,
      "title": "الإيمان يزيد وينقص",
      "text": "عن أبي سعيد الخدري رضي الله عنه عن النبي صلى الله عليه وسلم قال: يخرج من النار من قال لا إله إلا الله وفي قلبه وزن ذرة من خير",
      "source": "صحيح البخاري (44)",
      "category": "العقيدة والإيمان",
      "grade": "صحيح"
    },
    {
      "id": 6,
      "number": 6,
      "title": "فضل التوحيد",
      "text": "عن أنس رضي الله عنه قال: قال رسول الله صلى الله عليه وسلم: يقول الله تعالى لأهون أهل النار عذاباً يوم القيامة: لو أن لك ما في الأرض من شيء أكنت تفتدي به؟ فيقول: نعم، فيقول: قد أردت منك أهون من هذا وأنت في صلب آدم أن لا تشرك بي شيئاً فأبيت إلا أن تشرك بي",
      "source": "صحيح البخاري (6557)، صحيح مسلم (2805)",
      "category": "العقيدة والإيمان",
      "grade": "صحيح متفق عليه"
    },
    {
      "id": 7,
      "number": 7,
      "title": "من مات لا يشرك بالله",
      "text": "عن عبد الله بن مسعود رضي الله عنه قال: قال رسول الله صلى الله عليه وسلم: من مات وهو يدعو من دون الله نداً دخل النار",
      "source": "صحيح البخاري (4497)",
      "category": "العقيدة والإيمان",
      "grade": "صحيح"
    },
    {
      "id": 8,
      "number": 8,
      "title": "القضاء والقدر",
      "text": "عن ابن عباس رضي الله عنهما قال: كنت خلف النبي صلى الله عليه وسلم يوماً فقال: يا غلام إني أعلمك كلمات: احفظ الله يحفظك، احفظ الله تجده تجاهك، إذا سألت فاسأل الله، وإذا استعنت فاستعن بالله، واعلم أن الأمة لو اجتمعت على أن ينفعوك بشيء لم ينفعوك إلا بشيء قد كتبه الله لك، ولو اجتمعوا على أن يضروك بشيء لم يضروك إلا بشيء قد كتبه الله عليك، رفعت الأقلام وجفت الصحف",
      "source": "سنن الترمذي (2516)",
      "category": "العقيدة والإيمان",
      "grade": "صحيح - صححه الترمذي والألباني"
    },
    {
      "id": 9,
      "number": 9,
      "title": "الإيمان بالقدر",
      "text": "عن جابر بن عبد الله رضي الله عنه قال: قال رسول الله صلى الله عليه وسلم: لا يؤمن عبد حتى يؤمن بالقدر خيره وشره حتى يعلم أن ما أصابه لم يكن ليخطئه وما أخطأه لم يكن ليصيبه",
      "source": "سنن الترمذي (2144)",
      "category": "العقيدة والإيمان",
      "grade": "حسن - حسنه الترمذي والألباني"
    },
    {
      "id": 10,
      "number": 10,
      "title": "كلمة التوحيد",
      "text": "عن عثمان بن عفان رضي الله عنه قال: قال رسول الله صلى الله عليه وسلم: من مات وهو يعلم أنه لا إله إلا الله دخل الجنة",
      "source": "صحيح مسلم (26)",
      "category": "العقيدة والإيمان",
      "grade": "صحيح"
    },
    {
      "id": 11,
      "number": 11,
      "title": "فضل الصلاة",
      "text": "عن أبي هريرة رضي الله عنه قال: سمعت رسول الله صلى الله عليه وسلم يقول: أرأيتم لو أن نهراً بباب أحدكم يغتسل منه كل يوم خمس مرات هل يبقى من درنه شيء؟ قالوا: لا يبقى من درنه شيء، قال: فذلك مثل الصلوات الخمس يمحو الله بهن الخطايا",
      "source": "صحيح البخاري (528)، صحيح مسلم (667)",
      "category": "الصلاة",
      "grade": "صحيح متفق عليه"
    },
    {
      "id": 12,
      "number": 12,
      "title": "أول ما يحاسب عليه العبد",
      "text": "عن أبي هريرة رضي الله عنه قال: سمعت رسول الله صلى الله عليه وسلم يقول: إن أول ما يحاسب به العبد يوم القيامة من عمله صلاته، فإن صلحت فقد أفلح وأنجح، وإن فسدت فقد خاب وخسر",
      "source": "سنن الترمذي (413)، سنن النسائي (465)",
      "category": "الصلاة",
      "grade": "صحيح - صححه الألباني"
    },
    {
      "id": 13,
      "number": 13,
      "title": "الصلوات الخمس كفارة",
      "text": "عن أبي هريرة رضي الله عنه أن رسول الله صلى الله عليه وسلم قال: الصلوات الخمس، والجمعة إلى الجمعة، ورمضان إلى رمضان، مكفرات ما بينهن إذا اجتنب الكبائر",
      "source": "صحيح مسلم (233)",
      "category": "الصلاة",
      "grade": "صحيح"
    },
    {
      "id": 14,
      "number": 14,
      "title": "فضل صلاة الجماعة",
      "text": "عن ابن عمر رضي الله عنهما عن النبي صلى الله عليه وسلم قال: صلاة الجماعة تفضل صلاة الفذ بسبع وعشرين درجة",
      "source": "صحيح البخاري (645)، صحيح مسلم (650)",
      "category": "الصلاة",
      "grade": "صحيح متفق عليه"
    },
    {
      "id": 15,
      "number": 15,
      "title": "المشي إلى المسجد",
      "text": "عن أبي هريرة رضي الله عنه عن النبي صلى الله عليه وسلم قال: من غدا إلى المسجد أو راح أعد الله له في الجنة نزلاً كلما غدا أو راح",
      "source": "صحيح البخاري (662)، صحيح مسلم (669)",
      "category": "الصلاة",
      "grade": "صحيح متفق عليه"
    },
    {
      "id": 16,
      "number": 16,
      "title": "فضل انتظار الصلاة",
      "text": "عن أبي هريرة رضي الله عنه أن رسول الله صلى الله عليه وسلم قال: لا يزال أحدكم في صلاة ما دامت الصلاة تحبسه، لا يمنعه أن يرجع إلى أهله إلا الصلاة",
      "source": "صحيح البخاري (659)، صحيح مسلم (649)",
      "category": "الصلاة",
      "grade": "صحيح متفق عليه"
    },
    {
      "id": 17,
      "number": 17,
      "title": "صلاة الليل",
      "text": "عن أبي هريرة رضي الله عنه قال: قال رسول الله صلى الله عليه وسلم: أفضل الصلاة بعد الفريضة صلاة الليل",
      "source": "صحيح مسلم (1163)",
      "category": "الصلاة",
      "grade": "صحيح"
    },
    {
      "id": 18,
      "number": 18,
      "title": "قيام الليل",
      "text": "عن أبي هريرة رضي الله عنه أن رسول الله صلى الله عليه وسلم قال: ينزل ربنا تبارك وتعالى كل ليلة إلى السماء الدنيا حين يبقى ثلث الليل الآخر فيقول: من يدعوني فأستجيب له، من يسألني فأعطيه، من يستغفرني فأغفر له",
      "source": "صحيح البخاري (1145)، صحيح مسلم (758)",
      "category": "الصلاة",
      "grade": "صحيح متفق عليه"
    },
    {
      "id": 19,
      "number": 19,
      "title": "الخشوع في الصلاة",
      "text": "عن عثمان بن عفان رضي الله عنه قال: سمعت رسول الله صلى الله عليه وسلم يقول: ما من امرئ مسلم تحضره صلاة مكتوبة فيحسن وضوءها وخشوعها وركوعها إلا كانت كفارة لما قبلها من الذنوب ما لم يؤت كبيرة، وذلك الدهر كله",
      "source": "صحيح مسلم (228)",
      "category": "الصلاة",
      "grade": "صحيح"
    },
    {
      "id": 20,
      "number": 20,
      "title": "صلاة الفجر",
      "text": "عن أبي هريرة رضي الله عنه عن النبي صلى الله عليه وسلم قال: ركعتا الفجر خير من الدنيا وما فيها",
      "source": "صحيح مسلم (725)",
      "category": "الصلاة",
      "grade": "صحيح"
    }
  ],
  "categories": [
    "العقيدة والإيمان",
    "الصلاة",
    "الزكاة والصدقة",
    "الصيام",
    "الحج والعمرة",
    "الذكر والدعاء",
    "الأخلاق والآداب",
    "بر الوالدين وصلة الرحم",
    "الجهاد والشهادة",
    "العلم والتعلم",
    "الجنة والنار",
    "التوبة والاستغفار",
    "القلوب والنيات"
  ],
  "total": 123
}